Revit 2027 API
EvaluatedParameter.HasValue Property
 This property is true when the parameter value was successfully obtained, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValue { get; }
Public ReadOnly Property HasValue As Boolean
	Get
public:
property bool HasValue {
	bool get ();
}
member HasValue : bool with get
Property Value
Boolean
See Also
Reference
EvaluatedParameter Class
Autodesk.Revit.DB Namespace